#!/usr/bin/env python
# -*- coding=utf-8 -*-

# Author: 刘长飞 <liuchangfei@tuyoogame.com>
# Copyright (c) 2014, www.tuyoogame.com

"""
convert (lantitude, longitude) to city_code
"""


class CityLocator(object):
    def __call__(self, *argl, **argd):
        return self

    def _init_ctx_(self):
        from tyframework.context import TyContext
        self.__ctx__ = TyContext

    def __init__(self):
        self.DEFAULT_LOCATION = [1, u"全国"]
        self.CONFIG = [
            [230000, u"安徽", [115.248461, 34.454057], [119.364713, 29.66912]],
            [100000, u"北京", [115.795795, 40.638139], [117.150433, 39.65279]],
            [350000, u"福建", [116.135917, 27.945164], [120.198307, 23.69111]],
            [730000, u"甘肃", [94.158042, 40.734287], [108.317341, 32.947265]],
            [510000, u"广东", [110.012636, 25.244442], [117.070405, 20.429968]],
            [530000, u"广西", [105.097327, 26.067857], [111.688352, 21.489723]],
            [550000, u"贵州", [104.137884, 28.934154], [109.26453, 24.923562]],
            [570000, u"海南", [108.85101, 19.942909], [110.780909, 18.250958]],
            [50000, u"河北", [113.568086, 42.108025], [119.713616, 36.250568]],
            [450000, u"河南", [110.779737, 36.141696], [116.330775, 31.646279]],
            [150000, u"黑龙江", [122.715721, 52.945659], [134.296044, 44.032436]],
            [430000, u"湖北", [108.8271, 33.048428], [115.941883, 29.229496]],
            [410000, u"湖南", [109.168741, 29.801743], [113.906401, 24.977642]],
            [130000, u"吉林", [122.453677, 45.956172], [130.702367, 41.251411]],
            [210000, u"江苏", [116.615733, 34.88953], [121.678822, 31.014847]],
            [330000, u"江西", [113.739818, 29.834597], [118.277125, 24.772706]],
            [110000, u"辽宁", [119.271543, 43.000462], [125.290028, 38.900436]],
            [10000, u"内蒙", [100.099512, 51.660819], [124.474434, 38.275938]],
            [750000, u"宁夏", [105.111278, 39.108074], [107.049761, 35.529746]],
            [810000, u"青海", [92.608642, 38.327949], [102.775994, 32.178289]],
            [250000, u"山东", [115.074115, 38.077456], [122.406926, 34.587964]],
            [30000, u"山西", [110.488949, 40.403529], [114.213095, 34.709535]],
            [710000, u"陕西", [106.140871, 39.187272], [110.866934, 31.939262]],
            [200000, u"上海", [121.091425, 31.633565], [121.638481, 30.835081]],
            [610000, u"四川", [98.204993, 39.931534], [116.322218, 26.567907]],
            [300000, u"天津", [116.972772, 40.009614], [117.87353, 38.729573]],
            [850000, u"西藏", [79.552757, 33.984683], [98.62076, 27.67283]],
            [830000, u"新疆", [74.921544, 48.316559], [94.91157, 35.683432]],
            [650000, u"云南", [97.811532, 28.538866], [105.749608, 21.73666]],
            [310000, u"浙江", [118.33165, 30.983353], [122.481686, 27.434436]],
            [400000, u"重庆", [105.512656, 31.888131], [109.908611, 28.498315]],
        ]

    def calculate_province_code_and_name(self, longitude, lantitude):
        """ calculate province zip_code and name according to (long, lan)
            default is [1, u"全国"]
        """
        candidate_items = []
        for item in self.CONFIG:
            left_up = item[2]
            right_down = item[3]
            if (longitude > left_up[0] and longitude < right_down[0] and
                        lantitude < left_up[1] and lantitude > right_down[1]):
                candidate_items.append(item)
        if len(candidate_items) == 0:
            return self.DEFAULT_LOCATION[0], self.DEFAULT_LOCATION[1]

        elif len(candidate_items) == 1:
            return candidate_items[0][0], candidate_items[0][1]

        else:
            # find the nearest province
            distance = 100000000
            ret = None
            for item in candidate_items:
                center = [(item[2][0] + item[3][0]) / 2,
                          (item[2][1] + item[3][1]) / 2]
                d1 = longitude - center[0]
                d2 = lantitude - center[1]
                d = d1 * d1 + d2 * d2
                if d < distance:
                    distance = d
                    ret = item
            return ret[0], ret[1]


CityLocator = CityLocator()
